Revit 2024 API
View3D.SaveOrientation Method
 Converts the temporary orientation of the View3D into its saved orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SaveOrientation()
Visual Basic
Public Sub SaveOrientation
Visual C++
public:
void SaveOrientation()
Remarks
 The View3D will be oriented to its saved orientation on file open. To save the orientation of the default View3D, first rename the default View3D.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The orientation of the View3D cannot be saved.
See Also
View3D Class
Autodesk.Revit.DB Namespace